This one is a little different because it is a problem I myself came up with. Asking AI about it, it seems like what I describe here is similar to problems in leetcode and elsewhere known as "k-sum", though I think this formulation is a bit different. I'm not even sure that this doesn't have a much easier solution, but running through it, it's not obvious

* Python Implementation
:PROPERTIES:
:header-args:python+: :results silent
:header-args:python+: :session k-sum-problem
:header-args+: :exports both
:END:

#+begin_src python
  def get_lowest_incrementing_addends(lowest_first_number: int, k: int, desired_sum: int):
      assert 1<=k
      assert 0<desired_sum

      if desired_sum < lowest_first_number:
          return

      if k==1:
          yield desired_sum
          return

      yield lowest_first_number

      yield from get_lowest_incrementing_addends(lowest_first_number+1, k-1, desired_sum-lowest_first_number)
#+end_src

Lets test that

#+begin_src python :results output replace
  print(list(get_lowest_incrementing_addends(1, 4, 15)))
  print(list(get_lowest_incrementing_addends(2, 4, 15)))
  print(list(get_lowest_incrementing_addends(2, 3, 15)))
#+end_src

#+RESULTS:
: [1, 2, 3, 9]
: [2, 3, 4, 6]
: [2, 3, 10]

ok so I think that getting "all" should be similar, you just iterate upwards and spread out

#+begin_src python
  from typing import Iterator

  type SetOfAddends = tuple[int]

  def get_incrementing_addends(lowest_first_number: int, upper_bound: int, k: int, desired_sum: int) -> Iterator[SetOfAddends]:
      assert 1<=k, "K must be positive"

      if desired_sum <= 0:
          return

      if  upper_bound <= lowest_first_number:
          return

      if desired_sum < lowest_first_number:
          return

      if k==1:
          yield (desired_sum, )
          return

      for new_lowest_first_number in range(lowest_first_number, upper_bound):
          for addends in get_incrementing_addends(new_lowest_first_number+1, upper_bound, k-1, desired_sum-new_lowest_first_number):
              yield (new_lowest_first_number,)+ addends
#+end_src
#+begin_src python :results output replace
  print(list(get_incrementing_addends(1, 9, 3, 15)))
  print(list(get_incrementing_addends(1, 9, 4, 15)))
#+end_src

#+RESULTS:
: [(1, 2, 12), (1, 3, 11), (1, 4, 10), (1, 5, 9), (1, 6, 8), (2, 3, 10), (2, 4, 9), (2, 5, 8), (2, 6, 7), (3, 4, 8), (3, 5, 7), (4, 5, 6)]
: [(1, 2, 3, 9), (1, 2, 4, 8), (1, 2, 5, 7), (1, 3, 4, 7), (1, 3, 5, 6), (2, 3, 4, 6)]


Oh snap, I think that worked!

I do suspect that some further optimization is possible, it certainly is not necessary for that final loop to run all the way up to ~upper_bound~, but those branches would teriminate rapidly either way so I'm not concerned
